[
  {
    "companyName": "Water dev. Commision",
    "description": "Water Development Commission is looking to hire qualified applicants who fulfill the following requirements",
    "position": "General Manager Service",
    "education": "First Degree in Purchasing and Management, Management, Accounting",
    "yearsOfExperience": "7 years",
    "salary": "7544 Birr",
    "placeOfWork": "Addis Ababa",
    "deadLine": "2021-04-25",
    "howToApply": "Qualified applicants who fulfill the above requirements should submit all their necessary credentials such as Educational Background, Work Experince(include details such as employment details, start and end date as well as previous salary), CV along with an unreturnable photocopy to the following address. Haile Gebresilase Street, next to Capital Hotel, inside the Ministry of Water, Irrigation and Energy campus, 1st-floor Human Resource Management Office number 23 Addis Ababa."
  },
  {
    "companyName": "African Union",
    "description": "To provide strategic direction and leadership in managing the operations of the Finance Directorate to achieve the AU strategic objectives and goals.",
    "position": "Director of Finance",
    "education": "Master’s Degree in Accounting, Finance or related field.",
    "yearsOfExperience": "Fifteen (15) years of relevant work experience in Accounting, Finance, Auditing or Financial Management out of which eight (8) years at managerial level and five (5) years at supervisory level.",
    "salary": "US$ 78, 138.00",
    "placeOfWork": "Addis Ababa, Ethiopia",
    "deadLine": "2021-04-26",
    "howToApply": ""
  },
  
  {
    "companyName": "House of Federation",
    "description": "Center for the Study of Constitution and Federalism is looking to hire qualified applicants who fulfill the following requirements",
    "position": "Planning, Monitoring and Evaluation",
    "education": "First Degree in Economics, Public Financial Management, Project Management, management",
    "yearsOfExperience": "2 years of work experience in project planning, budget monitoring",
    "salary": "6,193.00 Birr",
    "placeOfWork": "Addis Ababa, Ethiopia",
    "deadLine": "2021-04-28",
    "howToApply": "Qualified applicants who fulfill the above requirements should submit all their necessary credentials such as Educational Background, Work experience, CV along with an unreturnable photocopy to the following address: at the receptionist office at the Office of the Federation Council around 4 kilo  Addis Ababa  Tel 0111226242 Fax 0111241208 POBox 20212/1000"
  },
  {
    "companyName": "SNV",
    "description": "Horti-LIFE II is a 3 years project (2019-2022) funded by the Embassy of the Kingdom of the Netherlands (EKN), implemented by SNV-Ethiopia in cooperation with the Ministry of Agriculture and Natural Resources. The program aims to increase export and food and nutritional security levels by supporting smallholder farmers in the horticulture sector.",
    "position": "Operation Officer",
    "education": "A relevant MSc degree (or equivalent like a BSc with a lot of experience). This means MBA /Administration / Finance",
    "yearsOfExperience": "A minimum of 10 years of work experience in administration.",
    "salary": "Negotiable",
    "placeOfWork": "Addis Ababa, Ethiopia",
    "deadLine": "2021-04-28",
    "howToApply": "Please send your application letter and CV that contains three referees as you apply with the position title as subject/reference. NB: Only shortlisted will be contacted. Women are encouraged to apply Additional Information Terms of Appointment This is a full-time position with the successful candidate being contracted on a 2 years contract with the possibility of renewal. Salary is competitive and commensurate with qualifications and experience with an attractive benefits package. SNV is a global organization committed to bringing different people, ideas, and perspectives together. We invite especially women to submit their application as we want to increase the number of women in leadership positions."
  },
  {
    "companyName": "Enat Bank",
    "description": "The Bank would like to invite competent and qualified candidates to apply for the following positions to be hired on a permanent basis.",
    "position": "Customer Service Specialist",
    "education": "BA in Accounting, Accounting & Finance, Banking & Insurance, Marketing, Business Administration, Management or other related fields",
    "yearsOfExperience": "1.5 years of experience or Diploma (Level 4) in the same fields with 3 years of experience in banking operation, customer service operation in the banking industry",
    "salary": "As per the bank's scale.",
    "placeOfWork": "Wolkite, Butajira, Chagni & Addis ababa, Ethiopia",
    "deadLine": "2021-04-22",
    "howToApply": "Interested applicants fulfilling the above requirements are invited to submit their applications and CVs with photocopies of non-returnable supporting credentials up to April 23, 2021 in person at Enat Bank S.C, Head Office around Kazanchis in front of Previous Yordanos Hotel, Enat Tower 6th floor or through 18401 postal address of the Bank Enat Bank P.O.Box: 18401 Only shortlisted candidates will be communicated Women applicants are highly encouraged. The Bank has the right to cancel the post advertised"
  },
  {
    "companyName": "Bunna International Bank",
    "description": "Bunna International Bank S.C is a fast-growing Bank that beliefs in professionalism and meritocracy. It also possesses an attractive pay structure and wide career opportunities. BIB now invites qualified and energetic candidates for the following position.",
    "position": "Customer Service Officer",
    "education": "First Degree in Accounting, Finance, Banking & Finance, Management, Economics or related fields.",
    "yearsOfExperience": "1 year of banking experience",
    "salary": "As the bank's scale",
    "placeOfWork": "Addis Ababa, Dangila, Debark & Alemgena, Ethiopia",
    "deadLine": "2021-04-23",
    "howToApply": "Interested and Qualified applicants are invited to submit their non-returnable, CV and Copies of testimonials with original documents within five consecutive working days from the date of this announcement to Bunna International Bank S.C Human Resource Management Directorate located in Arat kilo area at Haile Michael Admasu Building 2nd floor in front of Dabir Building Tel: 011 126 41 95 Addis Ababa"
  },
  {
    "companyName": "SG Consulting Engineers PLC",
    "description": "SG Consulting Engineers PLC a category one local engineering firm is seeking proven professionals for the following vacant position.",
    "position": "Accountant",
    "education": "BSc in Accounting from recognized University/College",
    "yearsOfExperience": "4 years of experience is required.",
    "salary": "Negotiable",
    "placeOfWork": "Addis Ababa, Ethiopia",
    "deadLine": "2021-04-24",
    "howToApply": "Interested applicants may send their comprehensive CV to Sgconsulting@ethionet.et can send their application letter along with their recent CV & Copy of their credentials to the following address. SG Consulting Engineers PLC On Megenagna (AMCHE) to Egziabherab Church Road Next to Tsinu Clinic/Aweraris Pharmacy Tel: +251 11 667 15 67/+251 11 896 53 86"
  },
  {
    "companyName": "Social Security Agency",
    "description": "Government Employees Social Security Agency is looking to hire qualified applicants who fulfill the following requirements",
    "position": "Audit Worker II",
    "education": "First Degree in Accounting, Public Finance Administration, Accounting and Finance, Public Financial Management, Auditing, Banking and Finance, Certified accounting auditing, Business Management, Management",
    "yearsOfExperience": "2 years of work experience in the related field.",
    "salary": "4,379.00 Birr",
    "placeOfWork": "Jimma, Sodo, Ethiopia",
    "deadLine": "2021-04-27",
    "howToApply": "Qualified applicants who fulfill the above requirements should submit all their necessary credentials such as Educational Background, Work experience, CV along with an unreturnable photocopy to the following address: 4 kilo in front of Kidist SIlase Church, Government Employees Social Security Agency Tel 011240590 Applicants with work experience from non-government institutes should bring proof of tax payment"
  },
  {
    "companyName": "UN ECA",
    "description": "ECA’s mission is to deliver ideas and actions for an empowered and transformed Africa; informed by the 2030 SDGs and Agenda 2063.",
    "position": "Director",
    "education": "An advanced university degree (Master’s or Doctorate) in economics, finance, business/public administration, social sciences, or related fields is required. A first-level degree (Bachelor’s or equivalent) in the specified fields with two additional years of relevant work experience may be accepted instead of the advanced university degree. A Ph.D. in finance, business/public administration, social sciences is an advantage.",
    "yearsOfExperience": "A minimum of fifteen years of progressively responsible experience in the private sector or energy, infrastructure or banking/ capital, markets or financial institutions/ financial regulatory bodies or related field is required. Demonstrated experience working with the Member States in support of policy-making, private sector investment, energy, infrastructure, innovative financing, in the context of Africa is desirable. Experience with the international finance system, structuring and execution of debt, and equity investments is desirable. Experience in conducting research and authorized publications in the area of private sector and investment is desirable.",   "salary": "",
    "placeOfWork": "Addis Ababa, Ethiopia",
    "deadLine": "2021-04-29",
    "howToApply": ""
  },
  {
    "companyName": "AAU",
    "description": "Addis Ababa University College of Social science is looking to hire qualified applicants who fulfill the following requirements.",
    "position": "Purchaser II",
    "education": "Diploma in Purchasing Management, Management, Accounting.",
    "yearsOfExperience": "2 years of work experience in Purchasing",
    "salary": "3,333.00 Birr",
    "placeOfWork": "Addis Ababa, Ethiopia",
    "deadLine": "2021-04-29",
    "howToApply": "Qualified applicants should submit all their necessary credentials such as Educational Background, Work Experince, One Photograph to the Human Resource Management office number 349 Addis Ababa University College of Social science, Tel 0118963941"
  },
  {
    "companyName": "Jemea Trading",
    "description": "Jemea Trading PLC is inviting interested and qualified applicants who fulfill the following requirements.",
    "position": "Junior Accountant",
    "education": "BA Degree in Accounting",
    "yearsOfExperience": "4 years",
    "salary": "Attractive and negotiable",
    "placeOfWork": "Addis Ababa, Ethiopia",
    "deadLine": "2021-04-20",
    "howToApply": "Interested applicants who can fulfill the criteria should submit a non-returnable copy of their credentials to the following address: Next to Tekle-Haymanort Hospital BETO Commercial Building, 3rd-floor office number 316, phone 0930469454 Email: JemeatradingVac@gmail.com"
  },
  {
    "companyName": "Renew Strategies",
    "description": "Are you graduating from your MBA, MFin or a similar degree this spring and looking to get your foot in the door with an impact-focused investment firm working in the fastest growing economies in Africa?",
    "position": "Graduate Fellowship",
    "education": "High school graduate",
    "yearsOfExperience": "No experience is required",
    "salary": "Negotiable",
    "placeOfWork": "Addis Ababa, Ethiopia",
    "deadLine": "2021-04-24",
    "howToApply": "To apply, email your resume and cover letter to renew@renewstrategies.com"
  },
  {
    "companyName": "IRC",
    "description": "The International Rescue Committee (IRC) is one of the largest humanitarian agencies in the world, providing relief, rehabilitation, and post-conflict reconstruction support to victims of oppression and violent conflict.  IRC has worked for over seven decades and today is involved in over 25 conflict zones in the world.  We address both the immediate, lifesaving needs of conflict-affected people in an emergency and the reconstruction needs in post-conflict societies.  IRC is committed to a culture of bold leadership, innovation in all aspects of our work, creative partnerships, and thorough accountability to those we serve.  The IRC is an international agency with offices in London, New York, and Geneva.",
    "position": "Finance Manager",
    "education": "The International Rescue Committee (IRC) is one of the largest humanitarian agencies in the world, providing relief, rehabilitation, and post-conflict reconstruction support to victims of oppression and violent conflict.  IRC has worked for over seven decades and today is involved in over 25 conflict zones in the world.  We address both the immediate, lifesaving needs of conflict-affected people in an emergency and the reconstruction needs in post-conflict societies.  IRC is committed to a culture of bold leadership, innovation in all aspects of our work, creative partnerships, and thorough accountability to those we serve.  The IRC is an international agency with offices in London, New York, and Geneva.",
    "yearsOfExperience": "Minimum 4 years of relevant experience for BA holders and 2 years for Master holders.",
    "salary": "Attractive",
    "placeOfWork": "Addis Ababa, Ethiopia",
    "deadLine": "2021-04-20",
    "howToApply": ""
  }
]
